soapRequest/Subtract.xml

<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <Subtract xmlns="http://tempuri.org/">
            <a>10</a>
            <b>15</b>
        </Subtract>
    </soap:Body>
</soap:Envelope>