target/classes/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:Add>
         <tem:a>15</tem:a>
         <tem:b>5</tem:b>
      </tem:Add>
   </soapenv:Body>
</soapenv:Envelope>