SoapRequest/Calculator.xml

<?xml version="1.0" encoding="utf-8"?>
<project>&lt;?xml version="1.0" encoding="utf-8"?&gt;
&lt;soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;soap:Body&gt;
    &lt;Add xmlns="http://tempuri.org/"&gt;
      &lt;a&gt;5&lt;/a&gt;
      &lt;b&gt;5&lt;/b&gt;
    &lt;/Add&gt;
  &lt;/soap:Body&gt;
&lt;/soap:Envelope&gt;</project>